In [153]:
import os
import pandas as pd
import numpy as np
import json
import requests
import time

Pull data, sort, and store into dataframe

In [155]:
reqApi = requests.get("https://web.spin.pm/api/gbfs/v1/los_angeles/free_bike_status.json").json()
apiDf = pd.DataFrame(reqApi['data']['bikes'])
apiDf.sort_values('bike_id', inplace=True)
apiDf.round(decimals=7)
apiDf.columns # List the column head

Index(['bike_id', 'is_disabled', 'is_reserved', 'lat', 'lon', 'vehicle_type'], dtype='object')

In [141]:
newDf = apiDf[['bike_id','lat','lon','vehicle_type']]
newDf.tail()

     bike_id        lat         lon vehicle_type
200  9788713  34.023801 -118.283792      scooter
288  9843571  33.996209 -118.477526      scooter
194  9847417  34.044125 -118.454932      scooter
395  9943552  34.043925 -118.467483      scooter
225  9957806  34.038577 -118.460839      scooter

In [142]:
# look for 
dupDf = newDf[newDf.duplicated(['bike_id'])]
dupDf

Empty DataFrame
Columns: [bike_id, lat, lon, vehicle_type]
Index: []

In [143]:
s = newDf['bike_id'].value_counts()
s.tail()
# checks unique id

2786082    1
1853080    1
6992539    1
5672606    1
3739351    1
Name: bike_id, dtype: int64

In [149]:
uniqueDf = pd.DataFrame(s)
uniqueDf.rename(columns={'bike_id':'counts'},inplace=True)
uniqueDf.tail()

         counts
2786082       1
1853080       1
6992539       1
5672606       1
3739351       1

In [152]:
uniqueDf.sum(axis=0)
# sum up uniqueDf counts

counts    413
dtype: int64

SEPARATED HERE | Testing code

In [156]:
data = pd.read_csv('employees.csv')

In [157]:
data.sort_values("Name", inplace=True)

In [158]:
data

            Name Department      Manager  Salary
1  Arsene Wenger        Bar   Friar Tuck      50
5  Dimi Berbatov        Foo  Little John      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
0     Robin Hood        NaN          NaN     200
4  Sam Allardyce        NaN          NaN     250

In [159]:
# Add new row using dictionary
thisDf = data.append({'Name': 'Joe Joe', 'Department': 'Foo', 'Manager': 'Me', 'Salary': '50'}, ignore_index=True)

In [160]:
# Add multiple rows
listOfSeries = [pd.Series(['John Cottinger', 'Bar', 'Little Blue', '250'], index = data.columns),
               pd.Series(['John Cottinger', 'Foo', 'Joe John', '500'], index = data.columns),
               pd.Series(['John Cottinger', 'Bar', 'Little Blue', '250'], index = data.columns)]
thisDf = thisDf.append(listOfSeries, ignore_index=True)
thisDf

             Name Department      Manager Salary
0   Arsene Wenger        Bar   Friar Tuck     50
1   Dimi Berbatov        Foo  Little John     50
2      Friar Tuck        Foo   Robin Hood    100
3     Little John        Foo   Robin Hood    100
4      Robin Hood        NaN          NaN    200
5   Sam Allardyce        NaN          NaN    250
6         Joe Joe        Foo           Me     50
7  John Cottinger        Bar  Little Blue    250
8  John Cottinger        Foo     Joe John    500
9  John Cottinger        Bar  Little Blue    250

In [167]:
thisDf.sort_values('Name', inplace=True)
thisDf

             Name Department      Manager Salary
0   Arsene Wenger        Bar   Friar Tuck     50
1   Dimi Berbatov        Foo  Little John     50
2      Friar Tuck        Foo   Robin Hood    100
6         Joe Joe        Foo           Me     50
7  John Cottinger        Bar  Little Blue    250
8  John Cottinger        Foo     Joe John    500
9  John Cottinger        Bar  Little Blue    250
3     Little John        Foo   Robin Hood    100
4      Robin Hood        NaN          NaN    200
5   Sam Allardyce        NaN          NaN    250

In [170]:
booColName = thisDf[thisDf.duplicated(['Name'])]
booColName

             Name Department      Manager Salary
8  John Cottinger        Foo     Joe John    500
9  John Cottinger        Bar  Little Blue    250

In [190]:
bahDf = pd.DataFrame(columns=["A","B","C"])
listOfSeries = [pd.Series(['this', 'Blue', '250'], index = bahDf.columns),
               pd.Series(['this', 'John', '500'], index = bahDf.columns),
                pd.Series(['that', 'Blue', '200'], index = bahDf.columns),
                pd.Series(['that', 'John', '500'], index = bahDf.columns),
               pd.Series(['that', 'Blue', '250'], index = bahDf.columns)]
bahDf = bahDf.append(listOfSeries, ignore_index=True)
bahDf

      A     B    C
0  this  Blue  250
1  this  John  500
2  that  Blue  200
3  that  John  500
4  that  Blue  250

Saves the first one and stores the duplicated into a new dataframe

In [191]:
bahDup = bahDf[bahDf.duplicated(['A'])]

In [192]:
bahDup

      A     B    C
1  this  John  500
3  that  John  500
4  that  Blue  250